import 'question.dart';
import 'dart:math';

class QuizBrain {
  int _score = 0;
  int _totalQuestionsAsked = 1;
  int qnum = 0;

  List<Questions> _quizQuestions = [
    Questions('ສະອາດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເປິເປຶ້ອນ', 'ຂ.ສົກກະປົກ',
        'ຄ.ບໍ່ເປຶ້ອນ', 'ງ.ວຸ້ນວາຍ', 3),
    Questions('ສົກຮຽນ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ມຶ້ຮຽນ', 'ຂ.ມຶ້ພັກ', 'ຄ.ໂຮງຮຽນ',
        'ງ.ປີຮຽນ', 4),
    Questions('.ຄຳວ່າ:ເປີດສົກຮຽນ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ມຶ້ເຂົ້າຮຽນ',
        'ຂ.ມຶ້ພັກ', 'ຄ.ໂຮງຮຽນ', 'ງ.ປີຮຽນ', 4),
    Questions('.ຄຳວ່າ:ປຶ້ມແບບຮຽນ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ປຶ້ມຂຽນ',
        'ຂ.ປຶ້ມໃຊ້ສຳລັບຮຽນ ', 'ຄ.ປຶ້ມເສດ', 'ງ.ປີຮຽນ', 2),
    Questions('.ຄຳວ່າ:ໜ້າປົກ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເຈ້ຍປົກໜ້າປຶ້ມ',
        'ຂ.ເຈ້ຍປົກຫຼັງປຶ້ມ', 'ຄ.ປື້ມຂຽນ', 'ງ.ປຶ້ມເສດ', 1),
    Questions('.ຄຳວ່າ:ຫຼັງປົກ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເຈ້ຍປົກໜ້າປຶ້ມ',
        'ຂ.ປຶ້ມຂຽນ', 'ຄ.ເຈ້ຍປົກຫຼັງປຶ້ມ', 'ງ.ປຶ້ມແບບຮຽນ', 3),
    Questions('.ຄຳວ່າ:ແຍງໄປແຍງມາ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ນອນຫຼັບ',
        'ຂ.ເບິ່ງໄປເບິ່ງມາ', 'ຄ.ແລ່ນໄປແລ່ນມາ', 'ງ.ຕຶ່ນນອນ', 2),
    Questions('.ຄຳວ່າ:ແວ່ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ແວະມາ, ມາເພື່ອພັກເຊົາ',
        'ຂ.ກັບມາບ້ານ', 'ຄ.ອອກຈາກບ້ານ', 'ງ.ກຳລັງເຮັດວຽກ', 1),
    Questions('.ຄຳວ່າ:ເຫຼັກໜາມ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ປະຕູບ້ານ', 'ຂ.ລວດເຫຼັກ',
        'ຄ.ລວດໄມ້', 'ງ.ລວດໜາມໝາກຈັບ', 4),
    Questions('.ຄຳວ່າ:ຫຼຸດຜ່ອນ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເຮັດໃຫ້ດີຂຶ້ນ',
        'ຂ.ເຮັດໃຫ້ເພີ່ມຂຶ້ນ', 'ຄ.ເຮັດໃຫ້ຫນ້ອຍລົງ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 3),
    Questions('.ຄຳວ່າ:ຊະຊາຍ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ສະອາດງາມຕາ', 'ຂ.ສະອາດ',
        'ຄ.ລະບຽບຮຽບຮ້ອຍ', 'ງ.ກະແຈກກະຈາຍ', 4),
    Questions('.ຄຳວ່າ:ປະຢັດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ບໍ່ຟຸມເຟືອຍ', 'ຂ.ຟຸມເຟືອຍ',
        'ຄ.ການໄປມາ', 'ງ.ການໄປການມາ', 1),
    Questions('.ຄຳວ່າ:ແອບ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ລີ້', 'ຂ.ເຝີກຝົນ',
        'ຄ.ພັກຜ່ອນ', 'ງ.ຊອກຫາສີ່ງຂອງ', 1),
    Questions('.ຄຳວ່າ:ໂອ້ອວດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ອ້າງ ຍ້ອງວ່າຕົນເອງເກັ່ງ',
        'ຂ. ສຸພາບ', 'ຄ. ຄົນອື່ນ', 'ງ.ບອກກ່າວ', 1),
    Questions('.ຄຳວ່າ:ຮັບປາກ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເຮັດໃຫ້ດີຂຶ້ນ',
        'ຂ.ພາຍາຍາມຫຼາຍຂຶ້ນ', 'ຄ.ປະຕິເສດ', 'ງ.ຕອບຮັບ.ຮັບຄຳ', 4),
    Questions('.ຄຳວ່າ:ຈົດໝາຍ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ໜັງສືຮຽນ', 'ຂ.ປຶ້ມຂຽນ',
        'ຄ.ໜັງສືທີ່ຂຽນສົ່ງຂ່າວເຖິງກັນ', 'ງ.ໜັງສືເຈ້ຍເສດ', 3),
    Questions('.ຄຳວ່າ:ປະດັບປະດາ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ຕົບແຕ່ງ', 'ຂ.ປ່ຽນແປງ',
        'ຄ.ລົບອອກ', 'ງ.ແກ້ໄຂ', 1),
    Questions('.ຄຳວ່າ:ສາມັກຄີ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ແຍກທາງກັນ',
        'ຂ.ພ້ອມພຽງກັນ', 'ຄ.ຕັ້ງໃຈ', 'ງ.ບໍ່ຖືກຈັກຂໍ້', 2),
    Questions('.ຄຳວ່າ:ສັງເກດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ການນົບໄຫ້ວ',
        'ຂ.ການອ່ອນນ້ອມຖ່ອມຕົວ', 'ຄ.ເບີ່ງ.ພິຈາລະນາ', 'ງ.ຝົນຕົກ', 3),
    Questions('.ຄຳວ່າ:ຄັງເງິນ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ບ່ອນນອນ',
        'ຂ.ບ່ອນເກັບເງິນ', 'ຄ.ບ່ອນເກັບເຄື່ອງໃຊ້', 'ງ.ບ່ອນເກັບເຄື່ອງມື', 2),
    Questions('.ຄຳວ່າ:ພືດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ຫຍ້າ ແລະ ຕົ້ນໄມ້',
        'ຂ.ເຄື່ອງມືຕ່າງໆ', 'ຄ.ຂອງກິນ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 1),
    Questions('.ຄຳວ່າ:ໄຟບໍ່ລຸກ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ໄຟໄຫມ້', 'ຂ.ໄຟບໍ່ຕິດ',
        'ຄ.ໄຟລາມ', 'ງ.ໄຟດັບ', 2),
    Questions('.ຄຳວ່າ:ໃຈຄັບແຄບ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເຫັນແກ່ຕົວ', 'ຂ.ຈິດໃຈດີ',
        'ຄ.ດູຖູກ', 'ງ.ຍ້ອງຍໍ', 1),
    Questions('.ຄຳວ່າ:ພະລະ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເມື່ອຍ', 'ຂ.ຮຽນ', 'ຄ.ກຳລັງ',
        'ງ.ຄວາມດຸໝັ່ນ', 3),
    Questions('.ຄຳວ່າ:ປະຕິຍານ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ໃຫ້ຄຳໝັ້ນສັນຍາ',
        'ຂ.ໃຫ້ຂໍ້ຄິດ', 'ຄ.ໃຫ້ເງິນ', 'ງ.ໃຫ້ສີ່ງທີ່ດີ', 1),
    Questions(
        '.ຄຳວ່າ:ດຽງສາ ມີຄວາມໝາຍວ່າແນວໃດ?',
        'ກ.ຄວາມຮູ້.ຮູ້ໃນສີ່ງທີ່ຜິດຫຼືຖືກ',
        'ຂ.ຄວາມຜິດ ',
        'ຄ.ຄວາມສົງໃສໃນສີ່ງທີ່ຖືກຫຼືຜິດ',
        'ງ.ບໍ່ຖືກຈັກຂໍ້',
        1),
    Questions('.ຄຳວ່າ:ມາລະຍາດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ຄວາມຮູ້', 'ຂ.ການປະພຶດ',
        'ຄ.ການສັ່ງສອນ', 'ງ.ການຮຽນ', 2),
    Questions('.ຄຳວ່າ:ປະເສີດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ຊົ່ວຫຼາຍ', 'ຂ.ດີຫຼາຍ',
        'ຄ.ອ່ອນຫຼາຍ', 'ງ.ເກັ່ງຫຼາຍ', 2),
    Questions('.ຄຳວ່າ:ອອມ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ລາຍຈ່າຍ', 'ຂ.ຖະໜອມ',
        'ຄ.ເງີນທີ່ເຫຼືອ', 'ງ.ເງີນທີ່ມີ', 2),
    Questions('.ຄຳວ່າ:ຮ່າງຄີງ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ຜິວ', 'ຂ.ຕົນຕົວ',
        'ຄ.ໃບໜ້າ', 'ງ.ມາລະຍາດ', 2),
    Questions('.ຄຳວ່າ:ສະບັ້ນ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ສັ້ນ', 'ຂ.ຍາວ', 'ຄ.ສັ່ນ',
        'ງ.ເໜັງຕີງ', 3),
    Questions('.ຄຳວ່າ:ຮູ້ສືກ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ການກະທຳ', 'ຂ.ການຕື່ນຕົວ',
        'ຄ.ການຮຽນ', 'ງ.ການຮັບຮູ້', 4),
    Questions('.ຄຳວ່າ:ເຊືອບຫຼັບ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ຫຼັບໄປແລ້ວ',
        'ຂ.ຕື່ນນອນແລ້ວ', 'ຄ.ກຳລັງນອນ', 'ງ.ນອນຫຼັບໄປໜ້ອຍໜຶ່ງ', 4),
    Questions('.ຄຳວ່າ:ຢືນຍົງ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ອາຍຸ', 'ຂ.ສຸຂະພາບ',
        'ຄ.ໝັ້ນຍືນ', 'ງ.ສີ່ງຂອງ', 3),
    Questions('.ຄຳວ່າ:ມໍລະດົກ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ຄວາມຮູ້', 'ຂ.ຊັບສົມບັດ',
        'ຄ.ຄວາມດີ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 2),
    Questions('.ຄຳວ່າ:ລ່ວງລັບ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ນອນຫຼັບ', 'ຂ.ຕາຍໄປ',
        'ຄ.ຮູ້ເມື່ອ', 'ງ.ປ່ອຍວາງ', 2),
    Questions('.ຄຳວ່າ:ຜົນລະປູກ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເຄື່ອງໃຊ້', 'ຂ.ຂອງກິນ',
        'ຄ.ເຄື່ອງປູກຂອງຝັງ', 'ງ.ເຄື່ອງນຸ່ງຫົ່ມ', 3),
    Questions('.ຄຳວ່າ:ຫຍຳ້ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ກິນ', 'ຂ.ກັດ', 'ຄ.ຄ້ຽວ',
        'ງ.ກືນ', 3),
    Questions('.ຄຳວ່າ:ກົກແຂ້ວ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ແຂ້ວເຫຼັ້ມນ້ອຍ',
        'ຂ.ແຂ້ວນຳ້ນົມ', 'ຄ.ຮາກແຂ້ວ', 'ງ.ແຂ້ວເຫຼັ້ມໃຫ່ຍ', 3),
    Questions('.ຄຳວ່າ:ແດດກ້າ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ແດດບໍ່ມີ', 'ຂ.ແດດອ່ອນ',
        'ຄ.ແດດຮ້ອນແຮງ ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 3),
    Questions('.ຄຳວ່າ:ດັບກິ່ນ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເຮັດໃຫ້ມີກິ່ນ',
        'ຂ.ເຮັດໃຫ້ບໍ່ມີກິ່ນ', 'ຄ.ເຮັດໃຫ້ກິ່ນຫອມ', 'ງ.ເຮັດໃຫ້ກິ່ນເໝັນ', 2),
    Questions('.ຄຳວ່າ:ລຳບາກ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ສະບາຍ', 'ຂ.ມີເງິນ',
        'ຄ.ຫຍຸ້ງຍາກ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 3),
    Questions('.ຄຳວ່າ:ຕຶ້ນຕັນໃຈ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ມີເງິນຫຼາຍ',
        'ຂ.ດີໃຈຫຼາຍ', 'ຄ.ຮຽນດີຫຼາຍ', 'ງ.ດຸໝັ່ນຫຼາຍ', 2),
    Questions('.ຄຳວ່າ:ສະຫຼາດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ພິບໄຫວດີ', 'ຂ.ໂງ່',
        'ຄ.ຄົນດີ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 1),
    Questions('.ຄຳວ່າ:ຫໍຜາສາດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເຮືອນທີ່ມີຍອດແຫຼມ',
        'ຂ.ເຮືອນທີ່ມີຮົ້ວ', 'ຄ.ເຮືອນທີ່ມີຄົນອາໃສ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 1),
    Questions('.ຄຳວ່າ:ຊົ້ນຢູ່ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ນອນຢູ່', 'ຂ.ລີ້ຢູ່',
        'ຄ.ຕື່ນຢູ່', 'ງ.ຫຼັບຢູ່', 2),
    Questions('.ຄຳວ່າ:ສະເຫວີຍສຸກ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເກັບໄວ້',
        'ຂ.ມີຄວາມສຸກ', 'ຄ.ເບີ່ງແຍງ', 'ງ.ໝາກໄມ້ຊະນິດໜື່ງ', 2),
    Questions('.ຄຳວ່າ:ຍູທ່າງ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເຮັດດ້ວຍຄວາມສະບາຍໃຈ',
        'ຂ.ເຮັດດ້ວຍຄວາມບໍ່ສະບາຍໃຈ', 'ຄ.ເຮັດດ້ວຍຄວາມດີ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 1),
    Questions('.ຄຳວ່າ:ໂລບມາກໂລພາ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເຫັນແກ່ຕົວ',
        'ຂ.ເຫັນແກ່ຄົນອື່ນ', 'ຄ.ເບີ່ງແຍງຕົວເອງ', 'ງ.ເບີ່ງແຍງຄົນອືີ່ນ', 1),
    Questions('.ຄຳວ່າ:ຈິບຫາຍ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເສຍໝົດ', 'ຂ.ໄດ້ໝົດ',
        'ຄ.ເກັ່ງໝົດ', 'ງ.ເສຍໃຈ', 1),
    Questions('.ຄຳວ່າ:ການກະເສດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ວຽກງານ', 'ຂ.ວຽກບ້ານ',
        'ຄ.ວຽກເຮືອນ', 'ງ.ວຽກປູກຝັງ', 1),
    Questions('.ຄຳວ່າ:ສິນຄ້າ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ຂອງທີ່ເກັບໄວ້',
        'ຂ.ຂອງຊຶ້ຂາຍ', 'ຄ.ສີ່ງຂອງທີ່ໃຊ້', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 2),
    Questions('.ຄຳວ່າ:ຄ້ຳຄູນ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ດີ', 'ຂ.ຊົ່ວ',
        'ຄ.ເສົາເຮືອນ', 'ງ.ພຶ້ນເຮືອນ', 1),
    Questions('.ຄຳວ່າ:ເຄື່ອງມື ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ເຄື່ອງນຸ່ງ',
        'ຂ.ເຄື່ອງນອນ', 'ຄ.ເຄື່ອງໃຊ້', 'ງ.ເຄື່ອງກິນ', 3),
    Questions('.ຄຳວ່າ:ເສຍຊີວິດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ຕາຍ', 'ຂ.ເກີດ',
        'ຄ.ສຳຄັນ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 1),
    Questions('.ຄຳວ່າ:ດັ້ງເດີມ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ແຕ່ກ່ອນ', 'ຂ.ແຕ່ມຶ້ວານ',
        'ຄ.ແຕ່ຕອນ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 1),
    Questions('.ຄຳວ່າ:ສັນຍາລັກ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ສີ່ງຂອງ', 'ຂ.ຈຸດເດ່ນ',
        'ຄ.ຈຸດອ່ອນ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 2),
    Questions('.ຄຳວ່າ:ປານີດ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ປາຊະນິດໜື່ງ', 'ຂ.ປ່ອຍປາ',
        'ຄ.ລະອຽດ', 'ງ.ບໍ່ລະອຽດ', 3),
    Questions('.ຄຳວ່າ:ປົບ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ແລ່ນໜີ', 'ຂ.ແລ່ນຫຼີ້ນ',
        'ຄ.ຍ່າງ', 'ງ.ຍ່າງຫຼີ້ນ', 1),
    Questions('.ຄຳວ່າ:ປອດໄພ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ບໍ່ມີອັນຕະລາຍ',
        'ຂ.ມີອັນຕະລາຍ', 'ຄ.ມີຄົນມາ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 1),
    Questions('.ຄຳວ່າ:ສັນຈອນ ມີຄວາມໝາຍວ່າແນວໃດ?', 'ກ.ກັບໄປ', 'ຂ.ກັບມາ',
        'ຄ.ການໄປການມາ', 'ງ.ບໍ່ມີຂໍ້ໃດຖືກ', 3),
  ];
  List<int> questionsAsked = [];

  int getScore() {
    return _score;
  }

  String getQuestion() {
    return _quizQuestions[qnum].question;
  }

  String getAnswer() {
    return getChoice(_quizQuestions[qnum]
        .ans); //This fetches the ans no and plugs it in the getChoice to return the correct answer
  }

  int getTotalQuestionsAsked() {
    return _totalQuestionsAsked;
  }

  void nextQuestion() {
    //verifies that the index of question is unique and updates the data member qnum to the new question number
    this.qnum = Random().nextInt(_quizQuestions
        .length); //This whole segment gets a random generated index for the question to be asked

    while (questionsAsked.contains(this.qnum)) {
      this.qnum = Random().nextInt(_quizQuestions.length);
    }
    questionsAsked.add(this.qnum); //Add this question index into the asked list
    print(qnum.toString() +
        ' was asked, questions asked so far ' +
        questionsAsked.length.toString());
  }

  bool checkAnswer(int selection) {
    bool isCorrect = false;
    if (selection == _quizQuestions[qnum].ans) {
      _score++;
      isCorrect = true;
      print('picked the correct answer ' + _score.toString());
    } else {
      print('picked the wrong answer');
    }
    _totalQuestionsAsked++; //regardless, question has been asked and button has been pressed
    return isCorrect;
  }

  String getChoice(int butChoice) {
    String choiceText;
    switch (butChoice) {
      case 1:
        choiceText = _quizQuestions[qnum].choice1;
        break;
      case 2:
        choiceText = _quizQuestions[qnum].choice2;
        break;
      case 3:
        choiceText = _quizQuestions[qnum].choice3;
        break;
      case 4:
        choiceText = _quizQuestions[qnum].choice4;
        break;
    }
    return choiceText;
  }

  void reset() {
    qnum = 0;
    _score = 0;
    _totalQuestionsAsked = 1;
    questionsAsked.clear();
  }
}
